Repository: DaiYu-233/YMCL
Catalog: YMCL.Main/Public/Lang/MainLang.*.resx
Languages: ja_jp, ru_ru

# InitializeWindow_Title
source: YMCL Initialization
ja_jp: YMCL初期化
ru_ru: Инициализация YMCL

# InitializeWindow_Title_Download
source: YMCL Initialization - Download Resources
ja_jp: YMCL -リソースをダウンロード
ru_ru: YMCL - Загрузите ресурсы

# InitializeWindow_NextSetpBtn
source: Next Step
ja_jp: 次へ
ru_ru: Cледующий шаг

# InitializeWindow_DownloadFinish
source: Download completed
ja_jp: ダウンロードが完了しました
ru_ru: Загрузка завершена

# InitializeWindow_Download_AdministratorPermissionRequired
source: Administrator privileges are required to initialize YMCL, Click OK to restart the program with administrator privileges
ja_jp: YMCLを初期化するには管理者権限が必要です，[OK]をクリックして、管理者権限でプログラムを再起動してください
ru_ru: Для инициализации YMCL требуются права администратора, Нажмите OK, чтобы перезапустить программу с правами администратора

# InitializeWindow_DownloadWaiting
source: Waiting
ja_jp: 待っています
ru_ru: Ожидание

# InitializeWindow_InitializeFinish
source: YMCL initialization complete
ja_jp: YMCLの初期化が完了しました
ru_ru: Инициализация YMCL завершена

# InitializeWindow_Connecting
source: Connecting
ja_jp: 接続しています
ru_ru: Соединение

# InitializeWindow_ConnectionFailed
source: Connection Failed
ja_jp: 接続に失敗しました
ru_ru: Не удалось подключить

# InitializeWindow_ConnectionTimeout
source: Connection Timeout
ja_jp: 接続がタイムアウトしました。再接続してください
ru_ru: Истекло время ожидания ответа

# InitializeWindow_FailedToObtainAdministratorPrivileges
source: Failed to get administrator privileges, YMCL initialization failed
ja_jp: 管理者権限の取得に失敗しました。YMCLの初期化に失敗しました
ru_ru: Не удалось получить права администратора, не удалось инициализировать YMCL

# MainWindow_NavigationLaunch
source: Launch
ja_jp: 起動
ru_ru: Пуск

# MainWindow_NavigationSetting
source: Settings
ja_jp: 設定
ru_ru: устанавливать

# MainWindow_NavigationDownload
source: Download
ja_jp: ダウンロード
ru_ru: загружать

# MainWindow_NavigationMore
source: More
ja_jp: より多く
ru_ru: Больше

# Setting_Navigation_Launch
source: Launch
ja_jp: 起動
ru_ru: Пуск

# Setting_Navigation_Account
source: Account
ja_jp: アカウント
ru_ru: Аккаунты

# Setting_Navigation_Download
source: Download
ja_jp: ダウンロード
ru_ru: загружать

# Launcher_SettingItem_Language
source: Language
ja_jp: 言語
ru_ru: язык

# Launcher_SettingItem_CustomMainPage
source: Customize the home screen
ja_jp: ホーム画面をカスタマイズ
ru_ru: Настройте домашний экран

# Launcher_SettingItem_EditCustomHomePage
source: Edit
ja_jp: 編集
ru_ru: редактор

# Launcher_UseCustomHomePageToggle_Toggled_On_Info
source: Custom pages will be enabled, YMCL does not guarantee the security of custom content, insecure custom content may cause devices to be attacked, etc
ja_jp: カスタムページが有効になります。YMCLはカスタムコンテンツのセキュリティを保証しません。安全でないカスタムコンテンツは、デバイスが攻撃される可能性があります
ru_ru: Пользовательские страницы будут включены, YMCL не гарантирует безопасность пользовательского контента, небезопасный пользовательский контент может привести к атаке на устройства и т. д

# Launch_Launch_CustomPageSourceError
source: Custom page (Xaml) source code error
ja_jp: カスタムページ（ Xaml ）ソースコードエラー
ru_ru: Ошибка исходного кода пользовательской страницы (XAML)

# Launch_MinecraftFolder
source: Minecraft Folder
ja_jp: Minecraftフォルダー
ru_ru: Папка Minecraft

# Launch_AddMinecraftFolder
source: Add Folder
ja_jp: フォルダーを追加
ru_ru: Добавить папку

# Launch_DelMinecraftFolder
source: Remove Selected
ja_jp: 選択したものを削除
ru_ru: Удалить выбранное

# Launch_AddMinecraftFolder_Click_NeedMinecraftFolder
source: Need to select the .minecraft folder
ja_jp: .minecraft フォルダーを選択する必要があります
ru_ru: Необходимо выбрать папку .minecraft

# Launch_AddMinecraftFolder_Click_ExistsMinecraftFolder
source: This folder already exists
ja_jp: このフォルダーは既に存在します
ru_ru: Эта папка уже существует

# Launch_AutoFindJava
source: Automatic Scan
ja_jp: 自動スキャン
ru_ru: Автоматическое сканирование

# Launch_ManualAddJava
source: Added manually
ja_jp: 手動で追加してください
ru_ru: Добавить вручную

# Launch_ManualAddJava_Click_ExistsJava
source: This Java already exists
ja_jp: このJavaはすでに存在します
ru_ru: Эта Java уже существует

# Launch_AutoFindJava_Click_ScanCompleted
source: Scan Complete: {|} Java found, of which {|} already exist in the list
ja_jp: スキャン完了：{|} 個のJavaが見つかりました。そのうち {|} 個は既にリストに存在しています
ru_ru: Сканирование завершено: {|} Java найдена, из которых {|} уже существуют в списке

# Account_AddAccount
source: Add New Account
ja_jp: 新しいアカウントを追加
ru_ru: Добавить новую учетную запись

# Account_DelAccount
source: Delete the selected account
ja_jp: 選択したアカウントを削除します
ru_ru: Удалите выбранную учетную запись

# Account_Cancel
source: Cancel
ja_jp: キャンセル
ru_ru: Отменить

# Account_Offline
source: Offline Login
ja_jp: オフラインでログイン
ru_ru: Войти в автономном режиме

# Account_Microsoft
source: Microsoft Login
ja_jp: Microsoftログイン

# Account_Third_Party
source: The Third-Party Login
ja_jp: サードパーティのログイン
ru_ru: Сторонний вход

# Account_UserName
source: Game username
ja_jp: ゲームユーザー名
ru_ru: Имя пользователя игры

# Account_Sure
source: OK
ja_jp: 確認
ru_ru: Подтвердить

# Account_VerificationCode
source: Verification Code
ja_jp: コードを確認してください
ru_ru: Проверьте код

# Account_Loading
source: Loading...
ja_jp: 読み込み中...
ru_ru: Загрузка...

# Account_CopyCodeAndOpenBrowser
source: Copy the code and open your browser
ja_jp: コードをコピーしてブラウザを開きます
ru_ru: Скопируйте код и откройте браузер

# Account_Password
source: Password
ja_jp: アカウントパスワード
ru_ru: Пароль учетной записи

# Account_ServerUrl
source: Authentication server
ja_jp: 認証サーバーアドレス
ru_ru: Адрес сервера аутентификации

# Account_Email
source: Email
ja_jp: メールアドレス

# Account_OfflineAccountAddBtn_Click_OfflineUserNameNull
source: Username cannot be empty
ja_jp: ユーザー名を空にすることはできません
ru_ru: Имя пользователя не может быть пустым

# Launch_MaxMem
source: Maximum Running Memory
ja_jp: 最大実行メモリ
ru_ru: Максимальный объем оперативной памяти

# Launch_ImportPack
source: Import Package
ja_jp: インテグレーションパッケージをインポート
ru_ru: Импортируйте интеграционный пакет

# Launch_Refresh
source: Refresh
ja_jp: リフレッシュ
ru_ru: Обновить

# Launch_VersionList
source: Version List
ja_jp: バージョンリスト
ru_ru: Список версий

# Launch_ToVersionList
source: Version List
ja_jp: バージョンリスト
ru_ru: Список версий

# Launch_ToVersionSetting
source: Version Settings
ja_jp: バージョン設定
ru_ru: Настройки версии

# Launch_LaunchGame
source: Launch
ja_jp: ゲームを起動してください
ru_ru: Запустите игру

# Launch_NoChooseGame
source: < No game core selected >
ja_jp: <ゲームコアが選択されていません>
ru_ru: < Ядро игры не выбрано >

# Launch_LoadMinecraftVersion_GetVersionListError
source: Error fetching version list
ja_jp: バージョンリストの取得中にエラーが発生しました
ru_ru: Ошибка при получении списка версий

# Launch_AutoSelectJava
source: Let YMCL choose the right Java
ja_jp: YMCLに適切なJavaを選ばせましょう
ru_ru: Пусть YMCL выберет правильную Java

# InitializeWindow_DownloadHelp
source: Can't finish downloading? Click for help
ja_jp: ダウンロードを完了できませんか？ヘルプをクリックしてください
ru_ru: Не можете завершить загрузку? Нажмите, чтобы получить помощь

# Launch_LaunchGame_Click_AccountError
source: Account Error
ja_jp: アカウントエラー
ru_ru: Ошибка аккаунта

# Launch_LaunchGame_Click_JavaError
source: Java Error
ja_jp: Javaエラー
ru_ru: Ошибка Java

# Launch_AloneCore
source: Version Isolated
ja_jp: バージョンが分離されました
ru_ru: Версия изолирована

# Launch_LaunchGame_Click_Launched
source: Startup complete
ja_jp: スタートアップが完了しました
ru_ru: Запуск завершен

# Launch_LaunchGame_Click_CannotFandRightJava
source: YMCL can't find the Java you need right now: Java
ja_jp: YMCLは現在必要なJavaを見つけることができません： Java
ru_ru: YMCL не может найти нужную вам Java прямо сейчас: Java

# Launch_LaunchGame_Click_FinishLaunch
source: Launch complete, waiting for the game window to appear
ja_jp: 起動が完了し、ゲームウィンドウが表示されるのを待っています
ru_ru: Запуск завершен, ждем появления игрового окна

# Launch_LaunchGame_Click_GameExit
source: Game exited
ja_jp: ゲームが終了しました
ru_ru: Игра завершена

# Launch_LaunchGame_Click_LaunchSuccess
source: Launch successfully
ja_jp: 正常に開始しました
ru_ru: Успешно запущено

# OpenSourceProjectUsageTable
source: Open Source Project Usage Sheet
ja_jp: オープンソースプロジェクト使用シート
ru_ru: Лист использования проекта с открытым исходным кодом

# CheckUpdate
source: Check updates now
ja_jp: アップデートを確認する
ru_ru: Проверить наличие обновлений

# GPL3Text
source: The YMCL is open source under the GPL-3.0 protocol. It can be modified and distributed, but the mark of the original work must not be deleted. The modified work must also be open-sourced under the GPL
ja_jp: YMCLはGPL-3.0プロトコルの下でオープンソースです。変更および配布することはできますが、元の作品のマークは削除してはなりません。変更された作品もGPLの下でオープンソースでなければなりません
ru_ru: YMCL является открытым исходным кодом под протоколом GPL-3.0. Он может быть изменен и распространен, но знак оригинальной работы не должен быть удален. Измененная работа также должна быть с открытым исходным кодом под GPL

# FindNewVersion
source: Found new version
ja_jp: 新しいバージョンを発見する
ru_ru: Откройте для себя новые версии

# LatestVersion
source: Is currently the latest version
ja_jp: あなたは現在最新です
ru_ru: Вы обновлены

# UpdateInfo
source: Update of Content
ja_jp: コンテンツの更新
ru_ru: Обновления

# DownloadUpdateQuestion
source: New version found, would you like to download the update?
ja_jp: 新しいバージョンが見つかりました。アップデートをダウンロードしますか？
ru_ru: Найдена новая версия, хотите загрузить обновление?

# TaskProgressWindow_Title
source: Task Progress
ja_jp: ミッションの進行状況
ru_ru: Прогресс миссии

source: Download Update
ja_jp: アップデートをダウンロード
ru_ru: Скачать обновление

source: Check update failed
ja_jp: アップデートの確認に失敗しました
ru_ru: Не удалось проверить наличие обновлений

# BeginUpdate
source: Start downloading update
ja_jp: アップデートのダウンロードを開始しましょう
ru_ru: Начните загрузку обновлений

# FinishUpdate
source: Update Download Completed
ja_jp: アップデートのダウンロードが完了しました
ru_ru: Обновление загрузки завершено

# DownloadFail
source: Download failed
ja_jp: ダウンロード失敗
ru_ru: Загрузка не удалась

# Setting_Navigation_Launcher
source: Personalize
ja_jp: パーソナライズ
ru_ru: Персонализация

# Setting_Navigation_About
source: Launcher
ja_jp: ランチャー
ru_ru: Пусковая установка

# DisplayTheme
source: Color Mode
ja_jp: カラーモード
ru_ru: Цветовой режим

source: Follow System
ja_jp: システムに従う
ru_ru: Следите за системой

source: Light
ja_jp: 薄い色
ru_ru: Светлый

source: Dark
ja_jp: 深い色合い
ru_ru: Темный

source: Download Source
ja_jp: ソースをダウンロード
ru_ru: Скачать исходный код

# MaximumDownloadThread
source: Max Download Threads
ja_jp: 最大ダウンロードスレッド数
ru_ru: Максимальное количество загружаемых потоков

# Launch_LaunchGame_Click_NoChooseGame
source: No game version selected or this version not found
ja_jp: ゲームバージョンが選択されていないか、このバージョンが見つかりません
ru_ru: Версия игры не выбрана или эта версия не найдена

# ArgsError
source: Parameter error
ja_jp: パラメータエラー
ru_ru: Ошибка параметра

# Launch_GameWindow
source: Game Window
ja_jp: ゲームウィンドウ
ru_ru: Окно игры

# Launch_DefaultSize
source: Default Size
ja_jp: デフォルトサイズ
ru_ru: Размер по умолчанию

# Launch_FullScreen
source: Full Screen
ja_jp: 全ウィンドウ表示
ru_ru: Полноэкранный режим

# Launch_CustomSize
source: Custom
ja_jp: ユーザ設定
ru_ru: Пользовательское

# Launch_OutputLogReceived
source: Show Output Log
ja_jp: 出力ログを表示
ru_ru: Показать журнал вывода

source: Launch Fail
ja_jp: 起動に失敗しました
ru_ru: Ошибка при запуске

# GameExitLogWindow
source: Close this window after 3s
ja_jp: 3秒後にこのウィンドウを閉じてください
ru_ru: Закройте это окно через 3 секунды

# BuildLaunchConfigError
source: Build launch parameter error, check launch settings for errors
ja_jp: ビルドスタートアップパラメータエラー。スタートアップ設定にエラーがないか確認してください
ru_ru: Ошибка параметра запуска сборки, проверьте настройки запуска на наличие ошибок

# Launch_TabItem_Overview
source: Overview
ja_jp: 概要
ru_ru: Обзор

# Launch_TabItem_Settings
source: Settings
ja_jp: 設定
ru_ru: устанавливать

source: Verifying Account
ja_jp: アカウントを認証しています
ru_ru: Подтверждение аккаунта

# Launch_LaunchBtn
source: Launch
ja_jp: ゲームを起動してください
ru_ru: Запустите игру

# Launch_LaunchBtn_Click_AccountError
source: Account Error
ja_jp: アカウントエラー
ru_ru: Ошибка аккаунта

# Launch_LaunchBtn_Click_NoChooseGame
source: No choose game core or game not found
ja_jp: ゲームコアが選択されていないか、ゲームが見つかりません
ru_ru: Не выбрано игровое ядро или игра не найдена

# Launch_LaunchBtn_Click_JavaError
source: Java Error
ja_jp: Javaエラー
ru_ru: Ошибка Java

# Launch_LaunchBtn_Click_Launched
source: Launched
ja_jp: 開始しました
ru_ru: Начато

# Launch_LaunchBtn_Click_FinishLaunch
source: Launch complete, waiting for the game window to appear
ja_jp: 起動が完了し、ゲームウィンドウが表示されるのを待っています
ru_ru: Запуск завершен, ждем появления игрового окна

# Launch_LaunchBtn_Click_GameExit
source: Game exited
ja_jp: ゲームが終了しました
ru_ru: Игра завершена

# Launch_LaunchBtn_Click_LaunchSuccess
source: Launch successfully
ja_jp: 正常に開始しました
ru_ru: Успешно запущено

# SaveCancel
source: Saved canceled
ja_jp: 保存がキャンセルされました
ru_ru: Сохраненные данные отменены

# SaveSuccess
source: Save successfully
ja_jp: 保存成功
ru_ru: Сохранение выполнено успешно

# SaveSkin
source: Save skin file
ja_jp: スキンファイルを保存
ru_ru: Сохранить файл скина

# Launch_LaunchBtn_Click_CannotFandRightJava
source: YMCL can't find the Java you need right now: Java
ja_jp: YMCLは現在必要なJavaを見つけることができません： Java
ru_ru: YMCL не может найти нужную вам Java прямо сейчас: Java

# Launch_VersionFolder
source: Version Folder
ja_jp: バージョンフォルダ
ru_ru: Папка версий

# Launch_SavesFolder
source: Archive Folder
ja_jp: アーカイブフォルダ
ru_ru: Архивировать папку

# Launch_ModFolder
source: Mod Folder
ja_jp: フォルダ
ru_ru: Папка модификаций

# Launch_ResourcePackFolder
source: ResourcePack Folder
ja_jp: 資源パックフォルダ
ru_ru: Папка пакета ресурсов

# Launch_ShaderPackFolder
source: ShaderPack Folder
ja_jp: ライトパックフォルダ
ru_ru: Папка Light Pack

# Launch_UseGlobalSettings
source: Use Global Setting
ja_jp: グローバル設定を使用
ru_ru: Использовать общие настройки

# Launch_SelectAll
source: Select All
ja_jp: すべて選択
ru_ru: Выбрать всё

# Launch_DeselectAll
source: Deselect all
ja_jp: 何も選択しないでください
ru_ru: Не выбирайте ни одного

# Launch_DisableSelectedItem
source: Disable Selected
ja_jp: 選択したものを無効にします
ru_ru: Отключить выбранное

# Launch_EnableSelectedItem
source: Enable Selected
ja_jp: チェックを有効にします
ru_ru: Включить Проверено

# Launch_DeleteSelectedItem
source: Delete Selected
ja_jp: 選択したものを削除
ru_ru: Удалить выбранное

# Launch_SelectedModCount
source: {|} files selected
ja_jp: {|}個のファイルが選択されました
ru_ru: Выбрано файлов: {|}

# SureDeleteMod
source: Move the following Mods to the Trash
ja_jp: 以下のモッドをゴミ箱に移動しましょう
ru_ru: Переместите следующие моды в корзину

# LoginFail
source: Login failed
ja_jp: ログイン失敗
ru_ru: Ошибка входа в систему

# UserDataError
source: User data processing failed
ja_jp: ユーザーデータの処理に失敗しました
ru_ru: Обработка пользовательских данных не удалась

# DownloadThreadTooBig
source: The download thread is too large and may cause the device to crash
ja_jp: ダウンロードスレッドが大きすぎるため、デバイスがクラッシュする可能性があります
ru_ru: Поток загрузки слишком велик и может привести к сбою устройства

# LoadVersionSettingFail
source: Failed to load version settings
ja_jp: バージョン設定の読み込みに失敗しました
ru_ru: Не удалось загрузить настройки версии

source: On
ja_jp: 開放する
ru_ru: включать

source: Off
ja_jp: 閉じる
ru_ru: закрыть

source: Use Global Setting
ja_jp: グローバル設定を使用
ru_ru: Использовать общие настройки

# AutoJoinServer
source: Automatically enter the server
ja_jp: 自動的にサーバーに入ります
ru_ru: Автоматический вход на сервер

# AutoInstall
source: Automatic installation
ja_jp: 自動インストール
ru_ru: Автоматическая установка

# AllVersion
source: All versions
ja_jp: すべてのバージョン
ru_ru: Все версии

# ReleaseVersion
source: formal edition
ja_jp: 正式版
ru_ru: официальное издание

# SnapshotVersion
source: preview edition
ja_jp: プレビュー版
ru_ru: предварительное издание

# OldVersion
source: ancient version
ja_jp: 古代バージョン
ru_ru: древняя версия

# InstallFinish
source: The installation is complete
ja_jp: インストールが完了しました
ru_ru: Установка завершена

source: Install Preview
ja_jp: プレビューをインストール
ru_ru: Установите предварительный просмотр

# BeginInstall
source: Start Install
ja_jp: インストールを開始してください
ru_ru: Начать установку

# AdditionalInstall
source: No additional installation
ja_jp: 追加のインストールはありません
ru_ru: Никакой дополнительной установки

source: Return
ja_jp: 戻る
ru_ru: Назад

# IncludeSpecialWord
source: Contains Special Characters
ja_jp: スペシャルキャラクター入り
ru_ru: Содержит специальных персонажей

# FileExists
source: Folder already exists
ja_jp: フォルダーは既に存在します
ru_ru: Папка уже существует

# ViewUpdate
source: What's New
ja_jp: 新着情報をチェック
ru_ru: Посмотрите, что нового

# LatsetVersion
source: Latest Version
ja_jp: 最新バージョン
ru_ru: Последняя версия

# WaitForGameWindowAppear
source: Wait for the game window to appear
ja_jp: ゲームウィンドウが表示されるまでお待ちください
ru_ru: Дождитесь появления игрового окна

source: Local File
ja_jp: ローカルファイル
ru_ru: Локальные файлы

source: Net file
ja_jp: ネットワークファイル
ru_ru: Сетевые файлы

source: Edit Xaml
ja_jp: Xamlを編集
ru_ru: Редактировать Xaml

# EditCSharp
source: Edit C #
ja_jp: C #を編集
ru_ru: Редактировать C #

# NeedRestartApp
source: YMCL needs to be restarted
ja_jp: YMCLを再起動する必要があります
ru_ru: Необходимо перезапустить YMCL

# CustomHomePageCSharpSouceError
source: Custom page (C #) source code error
ja_jp: カスタムページ（ C ＃）ソースコードエラー
ru_ru: Ошибка исходного кода пользовательской страницы (C #)

# ComPileCSharpError
source: Compile C # Error
ja_jp: C #コンパイルエラー
ru_ru: Ошибка компиляции C #

# InstallFail
source: Installation failled
ja_jp: インストール失敗
ru_ru: Ошибка установки

# GetInstallableVersionFail
source: Failed to get installable version
ja_jp: インストール可能なバージョンの取得に失敗しました
ru_ru: Не удалось получить устанавливаемую версию

source: Folder
ja_jp: フォルダ
ru_ru: Папка

source: User Data
ja_jp: ユーザーデータ
ru_ru: Данные пользователя

source: App Data
ja_jp: データを適用してください
ru_ru: Данные приложения

source: Open Folder
ja_jp: フォルダーを開きます
ru_ru: Открыть папку

# NoNetwork
source: No Network Connection
ja_jp: インターネットに接続されていません
ru_ru: Нет подключения к Интернету

# GetNoticeFail
source: Failed to get announcements
ja_jp: お知らせの取得に失敗しました
ru_ru: Не удалось получить объявления

source: Notice
ja_jp: 公告
ru_ru: header|Добавить объявление

# CannotFandRightJavaText
source: YMCL can't find the Java you need right now
ja_jp: YMCLは今必要なJavaを見つけることができません
ru_ru: YMCL не может найти нужную Java прямо сейчас

# YMCLNewVersion
source: Ymcl update available
ja_jp: Ymclアップデートが利用可能です
ru_ru: Доступно обновление Ymcl

# YggdrasilServerUrlIsEmpty
source: Verification server cannot be empty
ja_jp: 検証サーバーを空にすることはできません
ru_ru: Сервер верификации не может быть пустым

# YggdrasilPasswordIsEmpty
source: Password cannot be empty
ja_jp: パスワードを空にすることはできません
ru_ru: Пароль не может быть пустым

# YggdrasilEmailIsEmpty
source: Email cannot be empty
ja_jp: メールアドレスを空にすることはできません
ru_ru: Адрес электронной почты не может быть пустым

# App_UnhandledException
source: YMCL has an unhandled exception
ja_jp: YMCLには未処理の例外があります
ru_ru: У YMCL есть необработанное исключение

source: Theme color
ja_jp: テーマカラー
ru_ru: Цвет темы

source: Show Window
ja_jp: ウィンドウを表示
ru_ru: Показать окно

# TrueExit
source: Quit altogether
ja_jp: まったくやめろ
ru_ru: Полностью бросьте курить

# TasksCenter
source: task center
ja_jp: タスクセンター
ru_ru: Центр задач

# Install
source: Installation
ja_jp: インストール
ru_ru: Установка

source: Create Task
ja_jp: タスクを作成
ru_ru: Создайте задачу

# ClickToViewTaskCenter
source: Click to view mission progress >>
ja_jp: クリックしてミッションの進行状況を表示>>
ru_ru: Нажмите, чтобы просмотреть ход выполнения задания >>

source: Open Task Center
ja_jp: タスクセンターを開きます
ru_ru: Откройте Центр задач

# TreasureBox
source: Treasure chest
ja_jp: 宝箱
ru_ru: Сундук с сокровищами

source: Music Player
ja_jp: ミュージックプレーヤー
ru_ru: Музыкальный плеер

# OpenApp
source: Open
ja_jp: 開ける
ru_ru: Открыть

# RepeatOpen
source: Restart YMCL, go to the system tray to view the opened YMCL instance
ja_jp: YMCLを再起動し、システムトレイに移動して開いているYMCLインスタンスを表示します
ru_ru: Перезапустите YMCL, перейдите в системный лоток, чтобы просмотреть открытый экземпляр YMCL

# SearchFail
source: Search failed
ja_jp: 検索に失敗しました
ru_ru: Поиск не удался

# SearchNoResult
source: No result found
ja_jp: 結果が見つかりません
ru_ru: Нет результатов для поиска

# AddLocalFile
source: Add files
ja_jp: ファイルを追加
ru_ru: Add File

# SongFile
source: Audio file
ja_jp: オーディオファイル
ru_ru: Аудиофайлы

# SourceFileNotExists
source: Source file does not exist, it may be moved, renamed or deleted
ja_jp: ソースファイルが存在しません。移動、名前変更、または削除される可能性があります
ru_ru: Исходный файл не существует, его можно переместить, переименовать или удалить

# CheckSongAvailability
source: Checking music availability...
ja_jp: 音楽の利用可能性を確認しています...
ru_ru: Проверка доступности музыки...

# CannotConnectToApi
source: Unable to connect to the API
ja_jp: APIに接続できません
ru_ru: Не удалось подключиться к API

# MusicUnavailable
source: Music not available
ja_jp: 音楽は利用できません
ru_ru: Музыка недоступна

source: Getting music...
ja_jp: 音楽を手に入れよう...
ru_ru: Получить музыку...

# GettingLyric
source: Get lyrics...
ja_jp: 歌詞をゲット...
ru_ru: Получить текст...

# NoChooseSong
source: No music selected yet
ja_jp: 音楽がまだ選択されていません
ru_ru: Музыка еще не выбрана

# SaveMusicFile
source: Save the audio file
ja_jp: オーディオファイルを保存します
ru_ru: Сохраните аудиофайл

# CopyFileFail
source: Failed to copy file
ja_jp: ファイルのコピーに失敗しました
ru_ru: Не удалось скопировать файл

# BeginDownload
source: Start Download
ja_jp: ダウンロードを開始してください
ru_ru: Начать загрузку

# DesktopLyric
source: Desktop lyrics
ja_jp: デスクトップの歌詞
ru_ru: Тексты песен для настольных компьютеров

# DesktopLyricTextSize
source: Desktop Lyrics Text Size
ja_jp: デスクトップの歌詞のテキストサイズ
ru_ru: Размер текста текстов песен Desktop

# DesktopLyricTextAlignment
source: Desktop Lyrics Text Alignment Direction
ja_jp: デスクトップの歌詞のテキストの配置方向
ru_ru: Направление выравнивания текста текстов песен Desktop

# UseChange
source: Apply changes
ja_jp: 変更を適用してください
ru_ru: Применить изменения

# LeftAlignment
source: Left
ja_jp: 左揃え
ru_ru: по левому краю

# RightAlignment
source: Right align
ja_jp: または
ru_ru: Выровняйте по правому краю

# CenterAlignment
source: Center Align
ja_jp: 中央揃え
ru_ru: Выравнивание по центру

# ImportFinish
source: Imported
ja_jp: インポートが終了しました
ru_ru: Фильтры импорта

# GetVersionListFail
source: Failed to get version list
ja_jp: バージョンリストの取得に失敗しました
ru_ru: Не удалось получить список версий

# CustomIdHandleText
source: The current version name will be saved as
ja_jp: 現在のバージョン名はとして保存されます
ru_ru: Имя текущей версии будет сохранено как

source: All
ja_jp: すべて
ru_ru: полностью

source: Mod Name
ja_jp: モッド名
ru_ru: Название мода

source: Minecraft version
ja_jp: Minecraftバージョン
ru_ru: Версия Minecraft

source: Loading more
ja_jp: もっと読み込む
ru_ru: Загрузи больше

# AnyModLoader
source: Any loader
ja_jp: 任意のローダー
ru_ru: Любой погрузчик

source: Music
ja_jp: 音楽
ru_ru: Музыка

# MainWindow_NavigationMusic
source: Music
ja_jp: 音楽
ru_ru: Музыка

# WriteShortCut
source: Write a shortcut
ja_jp: ショートカットを書こう
ru_ru: Напишите ярлык

# WriteShortCutDescription
source: Create a shortcut to launch YMCL
ja_jp: YMCLを起動するためのショートカットを作成してください
ru_ru: Создайте ярлык для запуска YMCL

# UseCommandLaunchYMCLDescription
source: Launch YMCL by command
ja_jp: コマンドでYMCLを起動してください
ru_ru: Запустите YMCL по команде

# UseCommandLaunchYMCL
source: External launch
ja_jp: 外部発売
ru_ru: Внешний запуск

# SeletFolder
source: Select Folder
ja_jp: ソースを選択
ru_ru: Выберите папку

# WriteReg
source: Write registry
ja_jp: レジストリを書き込みます
ru_ru: Напишите реестр

# FailToWriteReg
source: Could not write to registry
ja_jp: レジストリに書き込めませんでした
ru_ru: Не удалось записать в реестр

# WriteFinish
source: Writing image done
ja_jp: 書き込みが完了しました
ru_ru: Запись завершена

# NoAvailableVersion
source: No version available
ja_jp: 利用可能なバージョンがありません
ru_ru: Версия недоступна

# GetUpdate
source: Get updates
ja_jp: アップデートをゲット
ru_ru: Получайте обновления

# CheckMissingResource
source: Check for missing resources
ja_jp: 不足している資源を確認してください
ru_ru: Проверьте, нет ли недостающих ресурсов

# NoResourceAreMissing
source: No resources are missing
ja_jp: 不足している資源はありません
ru_ru: Ресурсы отсутствуют

# ResourceAreMissing
source: There are missing resources
ja_jp: 資源が足りません
ru_ru: Не хватает ресурсов
